#include <iostream>
#include <stdlib.h>
#include <time.h>
using namespace std;
void main ()
{
	srand(time(0));
	int b,d,e,l,s;
	bool a;
	char c;
	setlocale(LC_CTYPE, "Ukrainian");
	cout << "Привiт!" << endl << "Вiтаю вас в грi, в якiй ви будете вгадувати числа. Для старту гри нажмiть - 0, а для виходу з гри - 1" << endl;
    cin >> a;
	if (a==0)
	cout << "Починаймо!!!" << endl;
	else
	goto a;
	b:
	cout << "Виберiть важкiсть:" << endl << "Легко - 1." << endl << "Нормально - 2" << endl << "Хард - 3" << endl << "Нереально - 4" << endl << "Вийти з гри - 6" << endl;
	cin >> c;
	if( c == '1' ) { 
	b=rand() % 10 +5;
	cout << "Вcе що вам потрiбно, це вгадати число яке я загадав. Так як ви граєте на легкому рiвнi складностi, то програти буде важко. Тим бiльше у вас є 3 спроби. Число знаходиться в дiапазонi вiд " << 0 << ", до " << b+1 << "." << endl;
	}
	else if( c == '2' ) { 
	b=rand() % 20 +10;
	cout << "Вам потрiбно вгадати число яке я загадав. У вас є 3 спроби. Число знаходиться в дiапазонi вiд " << 0 << ", до " << b+1 << "." << endl;	
	} 
	else if( c == '3' ) { 
	b=rand() % 50 +20;
	cout << "Ви не побоялися вибрати хард? Хах, зате зараз пошкодуєте. У вас є 3 спроби. Число знаходиться в дiапазонi вiд " << 0 << ", до " << b+1 << "." << endl;
	}
	else if( c == '4' ) { 
	b=rand() % 100 +50;
	cout << "Нереальний рiвень важкостi славиться тим,що вiн нереальний. Тому вам точно не вдасця його пройти. Я пожалiю вас, нажміть 1 щоб вийти з гри. Але, не нажимайте 2, це тiльки для обраних!" << endl;
	cin >> e;
	if (e == 1)
		{ 
		cout << "Сопляк! Я так i думав. Бiльше не грайте зi мною" << endl;
		goto a;
		}
	else
				cout << "Ви ще граєте? Гаразд. Зараз програєте, тому, що у вас є тiльки 3 спроби. Число знаходиться в дiапазонi вiд " << 0 << ", до " << b+1 << "." << endl;	
	}
	else if( c == '5' ) { 
	cout << "Нажаль iнсейну ще немає :(..." << endl;
	goto b;
	}  
	else if( c == '6' ) { 
	goto a;
	}  
	else { 
	goto b;
	} 
	e=(rand() % b +a)+1;
	s=3;	
	d:
//	cout << e;
	cin >> d;
	if( d == e )
	{
		if(c == '1')
		{
			cout << "Так, ви вгадали, я загадав число " << e << ". Але на легкому режимi кожен виграє! А ви попробуйте хочаб на нормальному" << endl;
			goto b;
		}
		if(c == '2')
		{
			cout << "Непогано, ви виграли мене. А як щодо гри на хардi?" << endl;
			goto b;
		}
		if(c == '3')
		{
			cout << "Нiчо собi, ви виграли мене на хардi. Але ви незможете виграти мене на нереальному рiвнi складностi. Недарма вiн називається нереальним." << endl;
			goto b;
		}
		if(c == '4')
		{
			cout << "Як ви виграли? У вас не було шансiв. Я так не граю. До побачення!" << endl;
			goto c;
		}
		if(c == '5')
		{
			cout << "Як ви сюди потрапили?!?" << endl;
			goto b;
		}
		cout << "А хтось знайшов баг в грi" << endl;
		goto b;

	}
	if(d!=e)
	{
		if(s == 3) 
		{
			if(c == '1')
			{
				cout << "Невгадали, в вас залишилося тiльки 2 спроби!" << endl;
				cout << s;
				s--;
				cout << s;
				goto d;
			}
			if(c == '2')
			{
				cout << "Нi. 2 спроби..." << endl;
				s--;
				goto d;
			}
			if(c == '3')
			{
				cout << "Нiчо собi, ви виграли мене на хардi. Жарт, в вас 2 спроби" << endl;
				s--;
				goto d;
			}
			if(c == '4')
			{
				cout << "Яж вас попереджував. Вiтаю, ви сьогоднi програєте. Залишилося 2 спроби..." << endl;
				s--;
				goto d;
			}
			cout << "Сьогоднi я щедрий, даю вам ще один щанс" << endl;
			goto d;
		}
		else
		{
			goto h;
		}
		h:
	if(s == 2 && d!=e)
		{
			if(c == '1')
			{
				cout << "Буде смiшно якщо хтось програє на легклму рiвнi. Останя спроба. Шкода що вона не допоможе" << endl;
				s--;
				goto d;
			}
			if(c == '2')
			{
				cout << "Все скоро буде добре...   ...для мене. Останя спроба" << endl;
				s--;
				goto d;
			}
			if(c == '3')
			{
				cout << "Хард перекладається з англiйської - важко. Чим ви думали коли йшли сюди. Останя спроба" << endl;
				s--;
				goto d;
			}
			if(c == '4')
			{
				cout << "Ще чучуть, ви майже справилися... напишiть якусь чифру щераз, бо менi вже не терпиться виграти." << endl;
				s--;
				goto d;
			}
			cout << "Я не люблю наглих! Читайте умову!" << endl;
			goto d;
		}
	if(s == 1 && d!=e)
		{
			if(c == '1')
			{
				cout << "До побачення..." << endl;
				s--;
				goto b;
			}
			if(c == '2')
			{
				cout << "Це аста ла вiста, бейбi!" << endl;
				s--;
				goto b;
			}
			if(c == '3')
			{
				cout << "Яж вам казав. Та ладно. Я виграв. Дарую вам можливiсть грати на легкому рiвнi складносi, не бiльше" << endl;
				s--;
				goto b;
			}
			if(c == '4')
			{
				cout << "Шкода, менi насправдi шкода своїх сусiдiв. Тому, що я кричу - УРА! Ем, а хоча, чому я дивуюся, нiхто i не сподiвався що ви виграєте, вернiше тепер на ти! Лузер (ти)" << endl;
				s--;
				goto b;
			}
			else
			{
				cout << "Ну все, до побачення!" << endl;
				goto a;
			}
		}
	c:
	a:
}
}