<!DOCTYPE html>
<html>
	<head>
		<?php
			require_once '../functions/main.php';
			require_once _API_;
			head(0, 0, 'Реєстрація', 'Реєстрація, register, Створити акаунт, Реєстрація в Громадській організації "Сучасна Волинь", Членство в Громадській організації "Сучасна Волинь"',1);
		?>
	</head>
	<body>
		<?php top();
		r(_USERS_, LINK, _DOMAIN_,'Дякуємо за реєстрацією в Громадській організації "Сучасна Волинь" ('.LINK.'). Для підтвердження пошти, перейдіть по цьому посиланню - ',_EMAIL_, 'Громадська організація "Сучасна Волинь"');
		down();?>
	</body>
<html>