<!DOCTYPE html>
<html lang="uk">
	<head>
		<?php
			require_once '../functions/main.php';
			require_once _API_;
			head(0,0,'Профіль');
		?>
	</head>
	<body>
		<?php top();
		p(LINK,_USERS_,_DOMAIN_, _EMAIL_, 'Науковий блог', 'Зміна пошти в Науковому блозі ('.LINK.'). Якщо це зробили ви, хвилюватиcя не потрібно. В іншому випадку, перейдіть по цьому посиланню щоб змінити пошту на попередню та захистити свій акаунт - ', 'Підтвердження пошти - Науковий блог ('.LINK.'). Для підтвердження пошти, перейдіть по цьому посиланню - ', 'Зміна паролю в Науковому блозі ('.LINK.'). Якщо це зробили ви, хвилюватиcя не потрібно. В іншому випадку, перейдіть по цьому посиланню щоб змінити логін на попередній та захистити свій акаунт - ');
		down();?>
	</body>
</html>