<!-- warranty -->
<!DOCTYPE html>
<html>
	<head>
		<?php
			include '../functions/main.php';
			head('Відгуки',$t,'Відгуки до магазину mambo shop, mambo shop перевірка, mambo shop проверка, coments',1,0,0,1);
		?>
	</head>
	<body>
		<?php menu();?>
		<?php c()?>
			<h1 class="title">Ми гарантуємо якість і безпеку</h1>
			<p class="title"><?=$t?></p>
			<?php function w($h,$p){
				echo '<div class="w_b l p_';
				static $i;
				if(($i%2)==0)
					echo 'g';
				else echo 'b';
				echo '">
					<img class="l" src="https://s8.hostingkartinok.com/uploads/images/2017/05/a422683cb35bccd885a899c2c47ac188.png" alt="'.$h.'">
					<h3>'.$h.'</h3>
					<p>'.$p.'</p>
				</div>';
				$i++;
			}
			w('Успішні продажі','На нашому рахунку більше 700 успішних продаж');
			w('Повна заміна','Ви завжди отримаєте заміну товару при несправності. Про деталі заміни читайте на сторінці опису кожного товару');
			w('Технічна підтримка','Щодня ми відповідаємо на численні ваші запитання і допомагаємо нашим покупцям. Ви можете задати ваше питання в розділі "Відгуки", на сторінці опису товару або нам в соцмережі - в розділі "Контакти"');
			w('Моментальна доставка','Купуючи товар, ви завжди отримаєте його одразу після оплати');
			w('Найнищі ціни','Ми отримуємо товари напряму від офіційних дилерів. Це забезпечує вам найнищі ціни та повну безпеку');
			w('Багато способів оплати','Ви завжди маєте можливість оплатити товар багатьма способами та в різних валютах (наприклад bitcoin)');
			w('Стабільність','Наший сайт працює цілодобово та без перебоїв');
			w('Повна підтримка','Наша команда допоможе вам зі всіма питаннями до і ПІСЛЯ купівлі');
			w('Оплата банківською картою','Ми використовуємо додаткове шифрування при оплаті банківською картою');
			?>
		<?php c(1)?>
	</body>
</html>