<!-- FAQ -->
<!DOCTYPE html>
<html>
	<head>
		<?php
			include '../functions/main.php';
			$dir=basename(dirname(__FILE__));
			head('FAQ','Відповіді на популярні запитання. Як оплатити? Де нас знайти? Коли розіграші? Наші правила? Вся інформація тут!','faq mambo shop, mambo shop правила, mambo shop як оплатити, mambo shop де купити, mambo shop як купити, mambo shop не працює, faq',0,0,0,1);
		?>
		<script>
			 function collapsElement(id) {
			 if ( document.getElementById(id).style.display != "none" ){ document.getElementById(id).style.display = 'none'; }
			 else { document.getElementById(id).style.display = ''; } }
		 </script>
	</head>
	<body>
		<?php menu(); ?>
		<?php c()?>
			<h1 class="title">FAQ</h1><br>
			<?php
				function f($h,$h2){
					static $i;
					$i++;
					if($h=="Правила сайту" && $_GET['t']=='rules')
						echo '<div class="title"><h3>'.$h.'</h3><br>
							<p>'.$h2.'</p>
						</div>';
					else
						echo '<div class="title"><a href="javascript:collapsElement(\''.$i.'\')" title="" rel="nofollow">'.$h.'</a>
							<div id="'.$i.'" style="display: none">
							<p>'.$h2.'</p>
							</div>
						</div>';
				}
				f('Як купити гру?','Натисніть на "Купити"<img src="https://s8.hostingkartinok.com/uploads/images/2017/05/e44950f57f721c6adae80889cf031724.jpg">Виберіть валюту та спосіб оплати<img src="http://s8.hostingkartinok.com/uploads/images/2016/10/93570f57f579da6816bd2c6298a5e966.jpg">Після проведення платежу вас перенаправить на сторінку для отримання товару. Якщо після проведення платежу вас автоматично не надішле на страінцу для отримання товару, можна зайти безпосередньо через сайт OPLATA.INFO або подивитися на пошті пряме посилання для отримання товару. На сторінці з товаром видно всі дані про продавця. Також ми бачимо оплачений товар<img src="http://s8.hostingkartinok.com/uploads/images/2016/10/e17a86a4e87cf293a8901f2c9d7d3227.jpg">');
				f('Правила сайту','Магазин залишає за собою повне право змінити правила без сповіщення про це користувачів.<br>Акаунт без підтвердження пошти, видаляється за 10 днів.<br>Наший магазин не купує ключі/товари, а перенапрямлює клієнтів на провірених партнерів.<br>Незнання правил не звільняє від відповідальності.<br>Ми не гарантуємо заміну несправного товару, при порушені правил з вашої сторони.<br>Заміна неробочого товару діє не на всі товари. Читайте опис товару.<br>Адміністрація ніколи не просить дані від вашого акаунту.<br>Заборонено використовувати аватарки, які порушують закони України або країни, в якій ви проживаєте.<br>Заборонено використовувати аватарки та ніки, які несть в собі оманливий або образливий характер.<br>Порушення правил карається за розглядом адміністрації.<br>Використання вад, помилок та недоробок сайту заборонено.<br>');
				f('Що таке розділ "Переписка" і де його знайти?','Розділ "Переписка" знаходиться на сторінці інформації про товар. Саме сюди потрібно писати продавцеві про отримання подарунку, бонусу, допомоги чи наприклад заміни товару при несправності. Зауважте, що писати продавцеві бажено російською мовою (більшість продавців не знають українську мову)<img src="http://s8.hostingkartinok.com/uploads/images/2016/10/fa379e9fff91362baa92a1b23718a83f.jpg">');
				f('Не працює акаунт/ключ/посилання','При несправності акауну/ключа/посилання зайдіть на сторінку опису цього товару. Прочитайте інструкцію (для того, щоб взнати про умови та можливість заміни/повернення грошей). Після цього зайдіть в розділ "Переписка" на сайті oplata.info (дивіться вище як це зробити). Напишіть продавцеві про несправність і ви отримаєте новий товар або повернення грошей<img src="http://s8.hostingkartinok.com/uploads/images/2016/10/ea6452bb5bba64bee4be2efa5397622a.jpg">');
				f('Не співпадає ціна в магазині та oplata.info','Ціна товару залежить від продавця і курсу гривні до рубля. Якщо ціна в магазині та на сайті oplata.info не співпвдвє то повідомте нам про це (дивіться нижче як це зробити)');
				f('Як звязатися з вами?','Ви можете написати нам в розділі <a href="../coments/">"Відгуки"</a>, на email - <a href="mailto:max@patii.uk">"max@patii.uk"</a> . Окрім цього, відвідайте розділ <a href="../coments/">"Контакти"</a>');
				f('Чи будуть відбуватися конкурси і розіграши?','Всі конкурси відбуваються на офіційному каналі магазину <a href="https://youtube.patii.uk">"В гостях у MAMBO"</a>');
			?>
		<?php c(1)?>
	</body>
</html>