<!DOCTYPE html>
<html>
	<head>
		<?php
			require_once '../functions/main.php';
			require_once _API_;
			head(0,0,'Профіль');
		?>
	</head>
	<body>
		<?php top();
		p(LINK,_USERS_,_DOMAIN_, _EMAIL_, 'Громадська організація "Сучасна Волинь"', 'Зміна пошти в Громадській організації "Сучасна Волинь" ('.LINK.'). Якщо це зробили ви, хвилюватиcя не потрібно. В іншому випадку, перейдіть по цьому посиланню щоб змінити пошту на попередню та захистити свій акаунт - ', 'Підтвердження пошти - Громадська організація "Сучасна Волинь" ('.LINK.'). Для підтвердження пошти, перейдіть по цьому посиланню - ', 'Зміна паролю в Громадській організації "Сучасна Волинь" ('.LINK.'). Якщо це зробили ви, хвилюватиcя не потрібно. В іншому випадку, перейдіть по цьому посиланню щоб змінити логін на попередній та захистити свій акаунт - ');
		down();?>
	</body>
<html>