//так виглядає однорядковий коментар
/* так
   виглядає
   юагато рядковий коментар
*/

/*
Змінні мають свої типи даних
int - ціле число.
int a = 10;
float - дробове число
float b = 3.112;
char - символ
char c = 'y';//символ пишеться в одинарних лапках

Синтаксис функції:
<те, що вона повертає, якщо нічого, то void> <назва функції>(<те, що функція приймає>){
 <вона щось виконує тут>
 return <значення>; // повертаємо якесь значення	
}
*/

#include <iostream>//підключаємо бібліотеку
//кожна бібліотека має свої йункції. Ця бібіліотека дає можливість використовувати cin та cout
using namespace std;//щоб не було функції які називаються однаково, існують простори імен. Кажемо програмі використовувати прості р імен під назвою "std"

int d10(int a){//int d10 - кажемо, що функція повертає ціле число (int), має назву d10. Також, в душках вказали, що вона приймає змінну типу int і дає їй назву a
	if (a%10==0)//if - перевірка, якщо щось рівне чомусь. a%10 - остача від ділення a на 10. Якщо a=10, то остача = 0. Перевіряємо чи остача від ділення є рівною (==) нулю
		cout << "Result: " << a/10 << endl;//якщо a%10==0, пишемо "Result " і a/10
	else//якщо ні,
		cout << "Ostacha: " <<a%10 << endl;//то виводимо остачу від ділення ("Ostacha: " і a%10)
	return 4;//функція поаертає значення 4
}

void main(){//функція, яка містить код програми. Не приймає значень, тому має пусті душки (). Нічого не повертає, тому має слово void
	int d;//створюємо змінну з назвою d, яка зберігає цілі числа
	d=5;//кажемо, що змінна d = 5
	cin >> d;//виводимо змінну d
	d10(d);//запускаємо функцію під назвою d10 і передаємо їх змінну d
	//функції та змінні можуть мати довільну назву
	d10(543);//запускаємо функцію і передаємо їй значення 543
	d = d10(70);//запускаємо функцію і передаємо їй значення 543. Функція повертає значення 4. Тому, ми присвоєїмо змінній d значення 4
	cout << d;//виводимо значення змінної d
}